/*
 Navicat Premium Data Transfer

 Source Server         : ass2
 Source Server Type    : MySQL
 Source Server Version : 50719
 Source Host           : localhost
 Source Database       : HefengSushi

 Target Server Type    : MySQL
 Target Server Version : 50719
 File Encoding         : utf-8

 Date: 12/12/2017 22:12:26 PM
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `Dish`
-- ----------------------------
DROP TABLE IF EXISTS `Dish`;
CREATE TABLE `Dish` (
  `id` varchar(11) NOT NULL,
  `DishName` varchar(255) CHARACTER SET utf8 NOT NULL,
  `Picture` varchar(255) NOT NULL,
  `Price` float(10,0) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `Dish`
-- ----------------------------
BEGIN;
INSERT INTO `Dish` VALUES ('1', '味增汤', '1.jpg', '2'), ('10', '扇贝裙边', '10.jpg', '6'), ('11', '三文鱼花', '11.jpg', '6'), ('11B', '蔬菜沙拉', '11B.jpg', '15'), ('12', '三文鱼小刺身拼盘（6片）', '12.jpg', '15'), ('13', '北极贝小刺身拼盘（12片）', '13.jpg', '15'), ('14', '南极虾小刺身拼盘（6只）', '14.jpg', '25'), ('15', '三文鱼北极贝刺身拼盘（8片三文鱼，12北极贝）', '15.jpg', '35'), ('16', '三文鱼狂欢', '16.jpg', '60'), ('17', '三文鱼花之恋', '17.jpg', '58'), ('18', '单人餐', '18.jpg', '25'), ('19', '经典双人', '19.jpg', '45'), ('2', '章鱼小丸子', '2.jpg', '7'), ('20', '豪华双人', '20.jpg', '53'), ('21', '经典四人', '21.jpg', '65'), ('22', '豪华四人', '22.jpg', '70'), ('23', '三文鱼握', '23.jpg', '3'), ('24', '北极贝握', '24.jpg', '3'), ('25', '带子握', '25.jpg', '4'), ('26', '雪蟹腿握', '26.jpg', '4'), ('27', '鳗鱼手握', '27.jpg', '3'), ('28', '芒果鳗鱼手握', '28.jpg', '3'), ('29', '蟹柳手握', '29.jpg', '3'), ('3', '日式煎饺', '3.jpg', '7'), ('30', '芝士蟹柳', '30.jpg', '3'), ('31', '鲜虾美乃滋', '31.jpg', '3'), ('32', '芝士虾', '32.jpg', '3'), ('33', '豆包', '33.jpg', '2'), ('34', '火炙三文鱼', '34.jpg', '3'), ('35', '炸虾握', '35.jpg', '3'), ('36', '三文鱼细卷', '36.jpg', '3'), ('37', '金枪鱼泥细卷', '37.jpg', '3'), ('38', '蟹柳细卷', '38.jpg', '3'), ('39', '青瓜细卷', '39.jpg', '3'), ('4', '豚骨拉面', '4.jpg', '15'), ('40', '日式大根细卷', '40.jpg', '3'), ('41', '玉子细卷', '41.jpg', '3'), ('42', '圆圆卷', '42.jpg', '4'), ('43', '鳗鱼卷', '43.jpg', '4'), ('44', '青鳗卷', '44.jpg', '4'), ('45', '芝士鳗鱼卷', '45.jpg', '4'), ('46', '火炙三文鱼卷', '46.jpg', '4'), ('47', '火炙三文鱼芝士卷', '47.jpg', '4'), ('48', '金枪鱼牛油果卷', '48.jpg', '4'), ('49', '鸡肉卷', '49.jpg', '4'), ('5', '鳗鱼饭', '5.jpg', '28'), ('50', '蟹子军舰', '50.jpg', '3'), ('51', '海草军舰', '51.jpg', '3'), ('52', '金枪鱼泥军舰', '52.jpg', '3'), ('53', '芥末章鱼军舰', '53.jpg', '3'), ('54', '龙虾沙拉军舰', '54.jpg', '3'), ('55', '扇贝裙边军舰', '55.jpg', '3'), ('56', '香油蘑菇军舰', '56.jpg', '3'), ('57', '生姜鱿鱼军舰', '57.jpg', '3'), ('58', '黄瓜包蟹子军舰', '58.jpg', '3'), ('59', '黄瓜包海草军舰', '59.jpg', '3'), ('6', '海草', '6.jpg', '4'), ('60', '黄瓜包金枪鱼泥军舰', '60.jpg', '3'), ('61', '黄瓜包芥末章鱼军舰', '61.jpg', '3'), ('62', '黄瓜包龙虾沙拉军舰', '62.jpg', '3'), ('63', '黄瓜包扇贝裙边军舰', '63.jpg', '3'), ('64', '黄瓜包香油蘑菇军舰', '64.jpg', '3'), ('65', '黄瓜包生姜鱿鱼军舰', '65.jpg', '3'), ('67', '三文鱼包蟹子军舰', '67.jpg', '4'), ('68', '三文鱼包海草军舰', '68.jpg', '4'), ('69', '三文鱼包金枪鱼泥军舰', '69.jpg', '4'), ('7', '毛豆', '7.jpg', '4'), ('70', '三文鱼包芥末章鱼军舰', '70.jpg', '4'), ('71', '三文鱼包龙虾沙拉军舰', '71.jpg', '4'), ('72', '三文鱼包扇贝裙边军舰', '72.jpg', '4'), ('73', '三文鱼包香油蘑菇军舰', '73.jpg', '4'), ('74', '三文鱼包生姜鱿鱼军舰', '74.jpg', '4'), ('8', '香油蘑菇', '8.jpg', '6'), ('9', '生姜鱿鱼', '9.jpg', '6');
COMMIT;

-- ----------------------------
--  Table structure for `Order`
-- ----------------------------
DROP TABLE IF EXISTS `Order`;
CREATE TABLE `Order` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `CustomName` varchar(255) NOT NULL,
  `Address` varchar(255) NOT NULL,
  `Order` varchar(255) NOT NULL,
  `Status` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

SET FOREIGN_KEY_CHECKS = 1;
